<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CategoriesSeeding extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('categories')->delete();

        DB::table('categories') -> insert ([
            'name' => ' Латиноамериканскі танці',
            'description'=>'Загальна назва бальних і народних танців, що сформувалися на території Латинської Америки. Подібно до того як Латинська Америка з\'явилася в результаті іспано-португальської колонізації. Отже, і латиноамериканські танці в основі мали переважно іспанський вплив.  '
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Бальні танці',
            'description'=>'Різновид парних танців, упорядкованих та кодифікованих для спортивних змагань. Спортивні танці визнаються Міжнародним олімпійським комітетом як кандидат в олімпійські види спорту. Нарівні зі спортивним аспектом бальні танці мають також соціальне значення, оскільки їх танцюють у всьому світі для розваги й задоволення і широко використовують у сценічному мистецтві: в театрі, кіно, на телебаченні.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Танці на пілоні',
            'description'=>'Вид спорту, який поєднує танець з гімнастичними вправами на пілоні (жердині). Танець на пілоні, визнаний видом фітнесу, який базується на аеробних та анаеробних вправах. Поєднує в собі елементи танцю та акробатичні трюки. В цих вправах пілон використовується як снаряд, партнер та тренажер.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Hip-Hop',
            'description'=>'Музичний жанр, який сформувався в Сполучених Штатах в 1970-ті роки. Складається зі стилізованої ритмічної музики, яка зазвичай супроводжується постукуванням, ритмікою і ритмом вимови. Він розроблений як частина хіп-хоп-культури, що складається з чотирьох ключових елементів:Реп, Скретч, Брейкданс, Графіті.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Бугалу',
            'description'=>'Жанр латинської музики і танцю, який був популярний в Сполучених Штатах у 1960-х роках. Бугалу виник в Нью-Йорку переважно серед латиноамериканських підлітків. Стиль був поєднанням популярного афроамериканського ритм-енд-блюзу (R&B) і соул-музики з мамбо і сон монтуно з піснями англійською та іспанською мовами . Танець і музику жанру бугалу основній американській аудиторії представила телевізійна музикальна програма American Bandstand, а пісня Піта Родрігеса "I Like It like That" набула великої популярності.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'R&B',
            'description'=>'RnB танець-танцю RnB як такого немає! Але є танець під музику RnB! Здебільшого танцювальні стилі пов\'язані зі стилями музики, що часто виражається в їх назвах. Танці під музику R\'N\'B це зараз одне з наймодніших напрямків на Заході. R\'N\'B Ви можете побачити в кліпах багатьох відомих західних виконавців: Justin Timberlake, Janet Jackson, Britney Spears, Mariah Carey, Shakira, B2K та інших. '
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Танець живота',
            'description'=>'сучасна форма давнього танцю, поширеного на Середньому Сході та в арабських країнах. Також відомий як Oryantal dansı, тобто «східний танок», єгипетський танок, арабський танок. Особливість танцю — пластичність та динамічність. Танець живота має багато різновидів, що залежать від країни та регіону, це стосується як костюмів, так і танцювальних рухів. Окремі нові стилі з\'явилися на Заході, коли танець почав набирати популярність.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Джаз-модерн',
            'description'=>'Один з напрямів сучасної зарубіжної хореографії, який зародився на початку XX ст. в США і Німеччині. Термін «Танець модерн» з\'явився в США для позначення сценічної хореографії, яке відкидає традиційні балетні форми. Увійшовши до вживання, витіснив інші терміни (вільний танець, дунканизм, танець босоніжок, ритмопластический танець, виразний, экспрессионистский, абсолютний, новий художній), які виникали в процесі розвитку цього напрямку. Спільним для представників танцю модерн, незалежно від того, до якої течії вони належали й у який період проголошували свої естетичні програми, був намір створити нову хореографію, відповідно їхньої думки, духовним потребам людини XX століття. '
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Степ',
            'description'=>'Танець степ є загальним терміном для танцювальних стилів, де робота ніг є найбільш важливою частиною танцю. Рухи кінцівок і манера виконання є обмеженими або несуттєвими.Степ є завершенням спектру танцювальних стилів. Більш екстремальним є структура танців (наприклад, сквер данс), де моделі руху навколо танцполу і робота рук є найбільш важливими факторами (робота ніг - дуже проста). Більшість побутових танців охоплюють ці дві протилежності.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Брейк-данс',
            'description'=>'Cтиль вуличного танцю, що розвився з хіп-хоп-руху в Південному Бронксі (Нью-Йорк), на початку 70-х років. Цей танець є одною з підвалин хіп-хоп культури. Це найстаріший і найвідоміший зі всіх стилів хіп-хоп-танців.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Основи класичного танцю',
            'description'=>'Система виразних засобів хореографічного мистецтва, що базується на ретельній розробці різних груп рухів та позицій ніг, рук, корпусу й голови, з\'явилась у XVII столітті. Рухи прагнуть до геометричної ясності, чому сприяє принцип виворотності.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Весільний танець',
            'description'=>'Перший танець молодого подружжя, що слугує своєрідним переходом між першим застілля та танцями. Згідно з традицією минулого століття – це мав бути вальс. Сучасні молодята не завжди вміють його танцювати. Тому часто вибирають повільну мелодію. Крім того популярною тенденцією є постановочний танець, який вивчається під керівництвом досвідченого хореографа. Частіше всього це нескладний, але ефектний танець, що ставиться за невелику кількість занять.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Народні танці',
            'description'=>'Фольклорний танець, який побутуює у своєму природному середовищі і має певні традиційні для даної місцевості рухи, ритми, костюми тощо. Фольклорний танець — це стихійний вияв почуттів, настрою, емоцій і виконується в першу чергу для себе, а потім — для глядача (товариства, гурту, громади)'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Східні танці',
            'description'=>'Сучасна форма давнього танцю, поширеного на Середньому Сході та в арабських країнах. Танець живота має багато різновидів, що залежать від країни та регіона, це стосується як костюмів, так і танцювальних рухів. Окремі нові стилі з\'явилися на Заході, коли танець почав набирати популярність.Східні танці це не лише танець живота бо це і мова жестів та тіла.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Трайбл',
            'description'=>'Це окремий вид, жанр в сучасному Танці, який поєднує в собі безліч напрямків. По-англійськи tribe — плем\'я, а tribal означає племінний, властивий якомусь племені. Танець постійно розвивається, змінюється і оновлюється. Визначальними поняттями є точні вивірені руху, оригінальні костюми і, головне, дух «племінного сестринства».'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Стріп-денс',
            'description'=>'танцювальний напрямок, основою якого є руху, що імітують роздягання. Стрип-данс є частиною стриптизу, проте не передбачає обов\'язкового роздягання. Це вміння зваблювати і спокушати, оголюючи тіла. Пластичність рухів, чуттєві жести, полумяний погляд - все це розбурхує фантазію глядача. До слова, щоб стати глядачем, зовсім необов\'язково відвідувати стриптиз-бари. Танці з елементами роздягання входять сьогодні в програму корпоративних вечірок і програм ресторанів. Цікаво, що з кожним роком все більше дівчат хочуть оволодіти цим мистецтвом. Причому, зовсім не для того, щоб виступати на сцені. Представниці прекрасної статі прагнуть розкріпачитися і стати ще більш привабливими для своїх супутників.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Контемп',
            'description'=>'Стиль сучасного сценічного танцю, що розвинувся зі стилів модерного та постмодерного танцю. Для контемпорарі характерна відмова від традиційних атрибутів балету, робота на підлозі. Танець цього стилю часто виконують босоніж. Напрям контемпорарі зародився на початку 20 століття в США в результаті бажання танцівників знайти нові засоби виразності на відміну від догм класичного танцю і легковажності естрадного танцю.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Сальса',
            'description'=>'Це парний кубинський танець африканського походження, який входить у програму сучасних латиноамериканських танців.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Бачата',
            'description'=>'Музичний стиль і парний танець домініканського походження. Танець широко поширений у країнах Карибського басейну.'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Аргентинське танго',
            'description'=>'Жанр музики і танець, притаманний регіону Ла-Плата, і найбільш поширений у містах Буенос-Айрес (Аргентина) та Монтевідео (Уругвай). Письменник Ернесто Сабато говорить про «гібридне» становище танго. За словами поета Едуардо Джорландіні, у ньому поєднуються афроамериканські корені, культура ґаучо, іспанські, італійські, африканські мотиви та етнічно строката суміш впливів, привнесених мігрантами з країн Європи. Письменник Рікардо Горват цитує визначення дослідниці танго Беатіс Крісоріо: «Танго — продукт багатонаціональних впливів, як колоніальних (індіанських, африканських і креольських), так і емігрантських». Відтоді танго зберігає статус одного з найпопулярніших жанрів музики, відомого в усьому світі'
        ]);
        DB::table('categories') -> insert ([
            'name' => 'Сонціаль танці',
            'description'=>'Одна з основних категорій у класифікації танців або танцювальних стилів за їх метою, яка характеризується первинною роллю спілкування та комунікації. Танці можуть відноситься одночасно до різних категорій, в залежності від цілі виконання.[1] Соціальні танці можуть бути як парними, так і сольними, хоча парні переважають.'
        ]);


    }
}
