<?php

return [
    
    'accepted' => 'Ви повинні прийняти :attribute.',
    'active_url' => 'Поле :attribute містить недійсний URL.',
    'after' => 'У поле :attribute повинна бути дата більше :date.',
    'after_or_equal' => 'У поле :attribute повинна бути дата більше або дорівнювати :date.',
    'alpha' => 'Поле :attribute може містити тільки літери.',
    'alpha_dash' => 'Поле :attribute може містити тільки букви, цифри, дефіс і нижнє підкреслювання.',
    'alpha_num' => 'Поле :attribute може містити тільки букви і цифри.',
    'array' => 'Поле :attribute має бути масивом.',
    'before' => 'У полі :attribute повинна бути дата раніше :date.',
    'before_or_equal' => 'У полі :attribute повинна бути дата раніше або дорівнювати :date.',
    'between' => [
        'numeric' => 'Поле :attribute має бути між :min і :max.',

        'file' => 'Розмір файлу в полі :attribute повинен бути між :min і :max Кілобайтів (а).',

        'string' => 'Кількість символів в полі :attribute має бути між :min і :max.',
        'array' => 'Кількість елементів в полі :attribute має бути між :min і :max.',
    ],
    'boolean' => 'Поле :attribute повинно мати значення логічного типу.',
    'confirmed' => 'Поле :attribute не збігається з підтвердженням.',
    
    'date' => 'Поле :attribute не є датою.',
    'date_equals' => 'Поле :attribute має бути датою рівною :date.',
    'date_format' => 'Поле :attribute не відповідає формату :format.',
    'different' => 'Поля :attribute і: other повинні відрізнятися.',
    'digits' => 'Довжина цифрового поля :attribute повинна бути :digits.',
    'digits_between' => 'Довжина цифрового поля :attribute повинна бути між :min і :max.',
    'dimensions' => 'Поле :attribute має неприпустимі розміри зображення.',
    'distinct' => 'Поле :attribute містить повторюване значення.',
    'email' => 'Поле :attribute має бути електронною адресою.',
    'ends_with' => 'Поле :attribute має закінчуватися одним з наступних значень:: values',
    'exists' => 'Вибране значення для :attribute некоректно.',
    'file' => 'Поле :attribute має бути файлом.',
    'filled' => 'Поле :attribute обов\'язково для заповнення.',
    'gt' => [
        'numeric' => 'Поле :attribute має бути більше: value.',
        'file' => 'Розмір файлу в поле :attribute повинен бути більше: value Кілобайтів (а).',
        'string' => 'Кількість символів в полі :attribute має бути більше: value.',
        'array' => 'Кількість елементів в полі :attribute має бути більше: value.',
    ],
    'gte' => [
        'numeric' => 'Поле :attribute має бути: value або більше.',
        'file' => 'Розмір файлу в поле :attribute повинен бути: value кілобайтів (а) або більше.',
        'string' => 'Кількість символів в полі :attribute має бути: value або більше.',
        'array' => 'Кількість елементів в полі :attribute має бути: value або більше.',
    ],
    'image' => 'Поле :attribute має бути зображенням.',
    'in' => 'Вибране значення для :attribute помилково.',
    'in_array' => 'Поле :attribute не існує в: other.',
    'integer' => 'Поле :attribute має бути цілим числом.',
    'ip' => 'Поле :attribute має бути дійсним IP-адресою.',
    'ipv4' => 'Поле :attribute має бути дійсним IPv4-адресою.',
    'ipv6' => 'Поле :attribute має бути дійсним IPv6-адресою.',
    'json' => 'Поле :attribute має бути JSON рядком.',
    'lt' => [
        'numeric' => 'Поле :attribute має бути менше: value.',
        'file' => 'Розмір файлу в поле :attribute повинен бути менше: value Кілобайтів (а).',
        'string' => 'Кількість символів в полі :attribute має бути менше: value.',
        'array' => 'Кількість елементів в полі :attribute має бути менше: value.',
    ],
    'lte' => [
        'numeric' => 'Поле :attribute має бути: value або менше.',
        'file' => 'Розмір файлу в поле :attribute повинен бути: value Кілобайтів (а) або менше.',
        'string' => 'Кількість символів в полі :attribute має бути: value або менше.',
        'array' => 'Кількість елементів в полі :attribute має бути: value або менше.',
    ],
    'max' => [
        'numeric' => 'Поле :attribute не може бути більше :max.',
        'file' => 'Розмір файлу в поле :attribute не може бути більше :max Кілобайтів (а).',
        'string' => 'Кількість символів в полі :attribute не може перевищувати :max.',
        'array' => 'Кількість елементів в полі :attribute не може перевищувати :max.',
    ],
    'mimes' => 'Поле :attribute має бути файлом одного з наступних типів:: values.',
    'mimetypes' => 'Поле :attribute має бути файлом одного з наступних типів:: values.',
    'min' => [
        'numeric' => 'Поле :attribute має бути не менше :min.',

        'file' => 'Розмір файлу в полі :attribute повинен бути не менше :min Кілобайтів (а).',

        'string' => 'Кількість символів в полі :attribute має бути не менше :min.',
        'array' => 'Кількість елементів в полі :attribute має бути не менше :min.',
    ],
    'multiple_of' => 'Значення поля :attribute має бути кратним: value',
    'not_in' => 'Вибране значення для :attribute помилково.',
    'not_regex' => 'Обраний формат для :attribute помилковий.',
    'numeric' => 'Поле :attribute має бути числом.',
    'password' => 'Неправильний пароль.',
    
    'present' => 'Поле :attribute має бути присутнім.',
    'regex' => 'Поле :attribute має хибний формат.',
   
    'required' => 'Поле :attribute обов\'язкове для заповнення.',
    'required_if' => 'Поле :attribute обов\'язкове для заповнення, коли: other одно: value.',
    'required_unless' => 'Поле :attribute обов\'язкове для заповнення, коли: other не дорівнює: values.',
    'required_with' => 'Поле :attribute обов\'язкове для заповнення, коли: values ​​вказано.',
    'required_with_all' => 'Поле :attribute обов\'язкове для заповнення, коли: values ​​вказано.',
    'required_without' => 'Поле :attribute обов\'язкове для заповнення, коли: values ​​не вказано.',
    'required_without_all' => 'Поле :attribute обов\'язкове для заповнення, коли жодна з: values ​​не вказано.',
    'same' => 'Значення полів :attribute і: other повинні збігатися.',
    'size' => [
        'numeric' => 'Поле :attribute має бути рівним: size.',
        'file' => 'Розмір файлу в полі :attribute має дорівнювати: size Кілобайтів (а).',
        'string' => 'Кількість символів в полі :attribute має бути рівним: size.',
        'array' => 'Кількість елементів в полі :attribute має бути рівним: size.',
    ],
    'starts_with' => 'Поле :attribute має починатися з одного з наступних значень:: values',
    'string' => 'Поле :attribute має бути рядком.',
    'timezone' => 'Поле :attribute має бути дійсним часового поясу.',
    'unique' => 'Таке значення поля :attribute вже існує.',
    'uploaded' => 'Завантаження поля :attribute не вдалася.',
    'url' => 'Поле :attribute має хибний формат URL.',
    'uuid' => 'Поле :attribute має бути коректним UUID.',

    
    // | ------------------------------------------------- -------------------------
    // | Власні мовні ресурси для перевірки значень
    // | ------------------------------------------------- -------------------------
    // |
    // | 
    // |
    // | 'Custom' => [
    // | 'Email' => [
    // | 'Required' => 'Нам необхідно знати Вашу електронну адреса!',

    // | ],
    // | ],
    // |
    

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
     
    

    

    
    ],

    
    // | ------------------------------------------------- -------------------------
    // | Власні назви атрибутів
    // | ------------------------------------------------- -------------------------
    // |
    // | Наступні рядки використовуються для підміни програмних імен елементів
    // | призначеного для користувача інтерфейсу на легким для читання. Наприклад, замість імені
    // | поля "email" в повідомленнях буде виводитися "електронна адреса".
    // |
    

    'attributes' => [
        'name' => 'Ім\'я',
        'username' => 'Нікнейм',
        'email' => 'Електронна адреса',
        'first_name' => 'Ім\'я',
        'last_name' => 'Прізвище',
        'password' => 'Пароль',
        'password_confirmation' => 'Підтвердження пароля',
        'city' => 'Місто',
        'country' => 'Країна',
        'address' => 'Адреса',
        'path' => 'Відео',
        'phone' => 'Телефон',
        'contact' => 'Контактний номер ',
        'age' => 'Дата народження',
        'contacts' =>'Контактний номер',
        'sex' => 'Стать',
        'gender' => 'Стать',
        'day' => 'День',
        'month' => 'Місяць',
        'year' => 'Рік',
        'hour' => 'Час',
        'minute' => 'Хвилина',
        'second' => 'Секунда',
        'title' => 'Назва',
        'apellido' => 'ПІБ',
        'name' => 'ПІБ',
        'content' => 'Контент',
        'description' => 'Опис',
        'excerpt' => 'Витримка',
        'date' => 'Дата',
        'time' => 'Час',
        'available' => 'Доступно',
        'size' => 'Розмір',
        'age_groups' => 'Вікові групи',
        'time_work' => 'Час роботи',
        'dance_style' => 'Стиль танцю',
        'living_place' => 'Місце проживання',
        'experience' => 'Досвід',
        'type' => 'тип',
        'author' => 'Автор',
        'content' => 'Текст',
        'program' => 'Програма',
        'area' => 'Площа',
        'coating' => 'Тип покриття',
        'duration' => 'Тривалість',
        'kind' => 'Вид занять',
        'dance_style' => 'Стиль танцю',
        'participation' => 'Участь у змаганнях',
        'about_yourself' => 'Про мене',
        'price' => 'Ціна',
        'sub' => 'Підкатегорія',
        'sub.*' => 'Підкатегорія',
        'maincategory' => 'Категорія',
        'subcategory' => 'Підкатегорія',
        'recording' => 'Тривалість запису',
        'services' => 'Послуги',
        'number' => 'Номер телефону',
        'organizers'=> 'Організатори',
        'contribution' => 'Внесок учасника',
        'conditions' => 'Умови участі',
        'roles' => 'Роль',
        'school_type' => 'Тип школи',
        'select_day.*' => '\'Час роботи\'',
        'changed_day.*' => '\'Час роботи\'',
        'age_begin.*' => 'Зі скільки років',
        'age_title.*' => 'Назва групи',
        'age_price.*' => 'Ціна',
        'age_end.*' => 'До скільки років',

    ],
];
